lvx/extension/InformationRegisters/бит_НастройкиПечатиПроизводственныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиПечатиПроизводственныхЗаданий</Name>
			<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыводитьПродукцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериалыВПодчиненииПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьВидыРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПечатнойФормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыПечатныхФормЗаказаНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДокументовНастроекПечатиПроизводственныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВРЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/extension/Enums/бит_ВидыДокументовНастроекПечатиПроизводственныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыДокументовНастроекПечатиПроизводственныхЗаданий</Name>
			<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПроизводство2_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПроизводства2_2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/extension/Enums/бит_ТипыПечатныхФормЗаказаНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыПечатныхФормЗаказаНаПроизводство</Name>
			<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МалярныйЦех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаФурнитуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/extension/Documents/ЭтапПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_Напечатано</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_СерииСгенерированы</Name>
					<Comment>ЛТ 6.7</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>бит_ГруппировкиПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АгрегированнаяНоменклатура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СигнатураСостава</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распечатано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>бит_СоставГруппировокПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/extension/CommonModules/бит_ПечатьПроизводственныхЗаданийСервер/Ext/Module.bsl
// {{ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [09.06.2026] +

#Область ГруппировкиЗаказа

Процедура АктуализироватьГруппировкиЗаказа(ОбъектЗаказ) Экспорт
	
	СтарыеСостояния = Новый Соответствие;
	Для Каждого СтрокаГруппы Из ОбъектЗаказ.бит_ГруппировкиПечатиБегунков Цикл
		СтарыеСостояния.Вставить(
			СтрокаГруппы.КлючГруппировки,
			Новый Структура("Сигнатура, Распечатано", СтрокаГруппы.СигнатураСостава, СтрокаГруппы.Распечатано));
	КонецЦикла;
	
	ДанныеГруппировок = Новый Соответствие;
	Для Каждого СтрокаПродукции Из ОбъектЗаказ.Продукция Цикл
		Если СтрокаПродукции.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		АгрегированнаяНоменклатура = НоменклатураВАгрегационномСегменте(
			СтрокаПродукции.Номенклатура,
			СтрокаПродукции.Характеристика);
		
		Если АгрегированнаяНоменклатура Тогда
			КлючГруппировки = "AGGREGATED";
			Представление = "Агрегированная номенклатура";
		Иначе
			КлючГруппировки = КлючАгрегации(
				СтрокаПродукции.Номенклатура,
				СтрокаПродукции.Характеристика,
				СтрокаПродукции.Спецификация);
			Представление = Строка(СтрокаПродукции.Номенклатура)
				+ ?(ЗначениеЗаполнено(СтрокаПродукции.Характеристика),
					"; " + Строка(СтрокаПродукции.Характеристика), "")
				+ ?(ЗначениеЗаполнено(СтрокаПродукции.Спецификация),
					"; " + Строка(СтрокаПродукции.Спецификация), "");
		КонецЕсли;
		
		ДанныеГруппы = ДанныеГруппировок.Получить(КлючГруппировки);
		Если ДанныеГруппы = Неопределено Тогда
			ДанныеГруппы = Новый Структура(
				"Представление, АгрегированнаяНоменклатура, Строки",
				Представление,
				АгрегированнаяНоменклатура,
				Новый Массив);
			ДанныеГруппировок.Вставить(КлючГруппировки, ДанныеГруппы);
		КонецЕсли;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("НомерСтроки", СтрокаПродукции.НомерСтроки);
		ДанныеСтроки.Вставить("Номенклатура", СтрокаПродукции.Номенклатура);
		ДанныеСтроки.Вставить("Характеристика", СтрокаПродукции.Характеристика);
		ДанныеСтроки.Вставить("Спецификация", СтрокаПродукции.Спецификация);
		ДанныеСтроки.Вставить("Назначение", СтрокаПродукции.Назначение);
		ДанныеСтроки.Вставить("Количество", СтрокаПродукции.Количество);
		ДанныеСтроки.Вставить("ДатаПотребности", СтрокаПродукции.ДатаПотребности);
		ДанныеГруппы.Строки.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	ОбъектЗаказ.бит_ГруппировкиПечатиБегунков.Очистить();
	ОбъектЗаказ.бит_СоставГруппировокПечатиБегунков.Очистить();
	
	Для Каждого ПараГруппы Из ДанныеГруппировок Цикл
		Сигнатура = СигнатураСтрокГруппировки(ПараГруппы.Значение.Строки);
		НоваяГруппа = ОбъектЗаказ.бит_ГруппировкиПечатиБегунков.Добавить();
		НоваяГруппа.КлючГруппировки = ПараГруппы.Ключ;
		НоваяГруппа.Представление = ПараГруппы.Значение.Представление;
		НоваяГруппа.АгрегированнаяНоменклатура = ПараГруппы.Значение.АгрегированнаяНоменклатура;
		НоваяГруппа.СигнатураСостава = Сигнатура;
		
		СтароеСостояние = СтарыеСостояния.Получить(ПараГруппы.Ключ);
		НоваяГруппа.Распечатано = СтароеСостояние <> Неопределено
			И СтароеСостояние.Сигнатура = Сигнатура
			И СтароеСостояние.Распечатано;
		
		Для Каждого СтрокаСостава Из ПараГруппы.Значение.Строки Цикл
			НоваяСтрока = ОбъектЗаказ.бит_СоставГруппировокПечатиБегунков.Добавить();
			НоваяСтрока.КлючГруппировки = ПараГруппы.Ключ;
			НоваяСтрока.НомерСтрокиПродукции = СтрокаСостава.НомерСтроки;
			НоваяСтрока.Номенклатура = СтрокаСостава.Номенклатура;
			НоваяСтрока.Характеристика = СтрокаСостава.Характеристика;
			НоваяСтрока.Спецификация = СтрокаСостава.Спецификация;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьГруппировкиДляПечати(СсылкаЗаказа) Экспорт
	
	ОбъектЗаказ = СсылкаЗаказа.ПолучитьОбъект();
	АктуализироватьГруппировкиЗаказа(ОбъектЗаказ);
	ОбъектЗаказ.Записать();
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("КлючГруппировки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Распечатано", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ГруппаПечати Из ОбъектЗаказ.бит_ГруппировкиПечатиБегунков Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.КлючГруппировки = ГруппаПечати.КлючГруппировки;
		НоваяСтрока.Представление = ГруппаПечати.Представление;
		НоваяСтрока.Распечатано = ГруппаПечати.Распечатано;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФормированиеПечатныхФорм

Функция СформироватьПечатнуюФормуЗаказов(МассивОбъектов, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	КлючиГруппировок = КлючиГруппировокИзПараметров(ПараметрыПечати);
	
	Для Каждого СсылкаЗаказа Из МассивОбъектов Цикл
		ОбъектЗаказ = СсылкаЗаказа.ПолучитьОбъект();
		АктуализироватьГруппировкиЗаказа(ОбъектЗаказ);
		
		ГруппыКПечати = ВыбранныеГруппыЗаказа(ОбъектЗаказ, КлючиГруппировок);
		Для Каждого ГруппаПечати Из ГруппыКПечати Цикл
			Листы = ПодготовитьЛистыЗаказа(ОбъектЗаказ, ГруппаПечати);
			ГруппаСформирована = Листы.Количество() > 0;
			Для Каждого ДанныеЛиста Из Листы Цикл
				Если Не ВывестиЛист(ТабличныйДокумент, ДанныеЛиста) Тогда
					ГруппаСформирована = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			Если ГруппаСформирована Тогда
				ГруппаПечати.Распечатано = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ОбъектЗаказ.Записать();
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуЭтапов(МассивОбъектов, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Для Каждого СсылкаЭтапа Из МассивОбъектов Цикл
		ДанныеЛиста = ПодготовитьЛистЭтапа(СсылкаЭтапа);
		Если ДанныеЛиста <> Неопределено Тогда
			Если ВывестиЛист(ТабличныйДокумент, ДанныеЛиста) Тогда
				ОбъектЭтапа = СсылкаЭтапа.ПолучитьОбъект();
				ОбъектЭтапа.бит_Напечатано = Истина;
				ОбъектЭтапа.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПодготовитьЛистыЗаказа(ОбъектЗаказ, ГруппаПечати)
	
	СоставГруппы = СоставГруппыЗаказа(ОбъектЗаказ, ГруппаПечати.КлючГруппировки);
	Назначения = Новый Массив;
	Для Каждого СтрокаСостава Из СоставГруппы Цикл
		СтрокаПродукции = ОбъектЗаказ.Продукция.Найти(СтрокаСостава.НомерСтрокиПродукции, "НомерСтроки");
		Если СтрокаПродукции = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СформированыЭтапыДляНазначения(
			ОбъектЗаказ.Ссылка,
			СтрокаПродукции.Назначение) Тогда
			СообщитьПользователюСТекстомЛистаТребований(
				"Для строки " + Строка(СтрокаПродукции.НомерСтроки)
				+ " заказа на производство не сформированы все этапы производства. "
				+ "Формирование печатной формы недоступно");
			Возврат Новый Массив;
		КонецЕсли;
		
		Если Назначения.Найти(СтрокаПродукции.Назначение) = Неопределено Тогда
			Назначения.Добавить(СтрокаПродукции.Назначение);
		КонецЕсли;
	КонецЦикла;
	
	Если Документы.ЭтапПроизводства2_2.ТребуетсяУточнитьЭтапы(ОбъектЗаказ.Ссылка) Тогда
		СообщитьПользователюСТекстомЛистаТребований(
			"Для группировки """ + ГруппаПечати.Представление
			+ """ заказа на производство не сформированы все этапы производства. "
			+ "Формирование печатной формы недоступно");
		Возврат Новый Массив;
	КонецЕсли;
	
	Этапы = ПолучитьЭтапыЗаказа(ОбъектЗаказ.Ссылка, Назначения);
	Если Этапы.Количество() = 0 Тогда
		СообщитьПользователюСТекстомЛистаТребований(
			"Для группировки """ + ГруппаПечати.Представление
			+ """ заказа на производство не сформированы все этапы производства. Формирование печатной формы недоступно");
		Возврат Новый Массив;
	КонецЕсли;
	
	ЛистыПоНастройкам = Новый Соответствие;
	// {{ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] +
	// Этапы уже упорядочены по НомерЭтапа, но обход Соответствия порядок вставки не гарантирует,
	// поэтому ключи листов запоминаются в массиве - для вывода в последовательности этапов.
	ПорядокКлючейЛистов = Новый Массив;
	// }}ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] -
	Для Каждого СсылкаЭтапа Из Этапы Цикл
		ОбъектЭтапа = СсылкаЭтапа.ПолучитьОбъект();
		ВРЦ = ОсновнойВидРабочегоЦентра(ОбъектЭтапа);
		Если ИсключенаПечать(ОбъектЭтапа.Подразделение, ВРЦ) Тогда
			Продолжить;
		КонецЕсли;
		
		Настройка = ПолучитьНастройкуПечати(
			Перечисления.бит_ВидыДокументовНастроекПечатиПроизводственныхЗаданий.ЗаказНаПроизводство2_2,
			ОбъектЭтапа.Подразделение,
			ВРЦ);
		Если Настройка = Неопределено Тогда
			СообщитьОбОтсутствииНастройки(ОбъектЭтапа.Подразделение, ВРЦ);
			Продолжить;
		КонецЕсли;
		
		КлючЛиста = КлючПодразделенияВРЦ(ОбъектЭтапа.Подразделение, ВРЦ);
		ДанныеЛиста = ЛистыПоНастройкам.Получить(КлючЛиста);
		Если ДанныеЛиста = Неопределено Тогда
			ДанныеЛиста = СоздатьДанныеЛиста(
				ОбъектЗаказ,
				СсылкаЭтапа,
				ОбъектЭтапа.Подразделение,
				ВРЦ,
				Настройка,
				QRСтрокаЗаказа(
					ОбъектЗаказ,
					ГруппаПечати,
					ОбъектЭтапа.Подразделение,
					ВРЦ),
				МинимальнаяДатаГруппы(ОбъектЗаказ, СоставГруппы));
			ЛистыПоНастройкам.Вставить(КлючЛиста, ДанныеЛиста);
			// {{ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] +
			ПорядокКлючейЛистов.Добавить(КлючЛиста);
			// }}ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] -
		КонецЕсли;

		ДобавитьДанныеЭтапаВЛист(ДанныеЛиста, ОбъектЭтапа);
	КонецЦикла;

	Листы = Новый Массив;
	// {{ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] +
	// Вывод листов в порядке этапов производства (по порядку ключей, а не обходом Соответствия).
	Для Каждого КлючЛиста Из ПорядокКлючейЛистов Цикл
		ДанныеЛиста = ЛистыПоНастройкам.Получить(КлючЛиста);
		СвернутьДанныеЛиста(ДанныеЛиста);
		Листы.Добавить(ДанныеЛиста);
	КонецЦикла;
	// }}ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] -

	Возврат Листы;
	
КонецФункции

Функция ПодготовитьЛистЭтапа(
		СсылкаЭтапа,
		ОбъектЗаказ = Неопределено,
		ГруппаПечати = Неопределено,
		СоставГруппы = Неопределено)
	
	ОбъектЭтапа = СсылкаЭтапа.ПолучитьОбъект();
	ВРЦ = ОсновнойВидРабочегоЦентра(ОбъектЭтапа);
	
	Если ОбъектЗаказ <> Неопределено
		И ИсключенаПечать(ОбъектЭтапа.Подразделение, ВРЦ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидДокумента = ?(
		ОбъектЗаказ = Неопределено,
		Перечисления.бит_ВидыДокументовНастроекПечатиПроизводственныхЗаданий.ЭтапПроизводства2_2,
		Перечисления.бит_ВидыДокументовНастроекПечатиПроизводственныхЗаданий.ЗаказНаПроизводство2_2);
	
	Настройка = ПолучитьНастройкуПечати(ВидДокумента, ОбъектЭтапа.Подразделение, ВРЦ);
	Если Настройка = Неопределено Тогда
		СообщитьОбОтсутствииНастройки(ОбъектЭтапа.Подразделение, ВРЦ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбъектЗаказ = Неопределено Тогда
		ОбъектЗаказ = ОбъектЭтапа.Распоряжение.ПолучитьОбъект();
	КонецЕсли;
	
	Если ГруппаПечати = Неопределено Тогда
		QR = QRСтрокаЭтапа(ОбъектЭтапа, ВРЦ);
		ДатаИсполнения = МинимальнаяДатаЭтапа(ОбъектЭтапа);
	Иначе
		QR = QRСтрокаЗаказа(
			ОбъектЗаказ,
			ГруппаПечати,
			ОбъектЭтапа.Подразделение,
			ВРЦ);
		ДатаИсполнения = МинимальнаяДатаГруппы(ОбъектЗаказ, СоставГруппы);
	КонецЕсли;
	
	ДанныеЛиста = СоздатьДанныеЛиста(
		ОбъектЗаказ,
		СсылкаЭтапа,
		ОбъектЭтапа.Подразделение,
		ВРЦ,
		Настройка,
		QR,
		ДатаИсполнения);
	ДобавитьДанныеЭтапаВЛист(ДанныеЛиста, ОбъектЭтапа);
	СвернутьДанныеЛиста(ДанныеЛиста);
	
	Возврат ДанныеЛиста;
	
КонецФункции

Функция СоздатьДанныеЛиста(
		ОбъектЗаказ,
		СсылкаЭтапа,
		Подразделение,
		ВРЦ,
		Настройка,
		QR,
		ДатаИсполнения)
	
	ДанныеЛиста = Новый Структура;
	ДанныеЛиста.Вставить("Заказ", ОбъектЗаказ.Ссылка);
	ДанныеЛиста.Вставить("Этап", СсылкаЭтапа);
	ДанныеЛиста.Вставить("Подразделение", Подразделение);
	ДанныеЛиста.Вставить("ВРЦ", ВРЦ);
	ДанныеЛиста.Вставить("Комментарий", ОбъектЗаказ.Комментарий);
	ДанныеЛиста.Вставить("Настройка", Настройка);
	ДанныеЛиста.Вставить("QR", QR);
	ДанныеЛиста.Вставить("ДатаИсполнения", ДатаИсполнения);
	ДанныеЛиста.Вставить("Продукция", Новый Массив);
	ДанныеЛиста.Вставить("Материалы", Новый Массив);
	ДанныеЛиста.Вставить("ВидыРабот", Новый Массив);
	ДанныеЛиста.Вставить("Передача", Новый Массив);
	
	Возврат ДанныеЛиста;
	
КонецФункции

Процедура ДобавитьДанныеЭтапаВЛист(ДанныеЛиста, ОбъектЭтапа)
	
	ЗаполнитьПродукциюЛиста(ДанныеЛиста, ОбъектЭтапа);
	ЗаполнитьМатериалыЛиста(ДанныеЛиста, ОбъектЭтапа);
	ЗаполнитьВидыРаботЛиста(ДанныеЛиста, ОбъектЭтапа);
	ЗаполнитьПередачуЛиста(ДанныеЛиста, ОбъектЭтапа);
	
КонецПроцедуры

#КонецОбласти

#Область СборДанных

Процедура ЗаполнитьПродукциюЛиста(ДанныеЛиста, ОбъектЭтапа)
	
	Если Не ДанныеЛиста.Настройка.ВыводитьПродукцию Тогда
		Возврат;
	КонецЕсли;
	
	СводныеДанные = Новый Соответствие;
	Для Каждого СтрокаПродукции Из ОбъектЭтапа.ВыходныеИзделия Цикл
		Если СтрокаПродукции.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = КлючАгрегации(
			СтрокаПродукции.Номенклатура,
			СтрокаПродукции.Характеристика,
			СтрокаПродукции.Спецификация);
		Данные = СводныеДанные.Получить(Ключ);
		Если Данные = Неопределено Тогда
			Данные = Новый Структура;
			Данные.Вставить("Ключ", Ключ);
			Данные.Вставить("Код", СтрокаПродукции.Номенклатура.Код);
			Данные.Вставить("Артикул", СтрокаПродукции.Номенклатура.Артикул);
			Данные.Вставить("Номенклатура", ПредставлениеНоменклатуры(
				СтрокаПродукции.Номенклатура,
				СтрокаПродукции.Характеристика));
			Данные.Вставить("Единица", СтрокаПродукции.Номенклатура.ЕдиницаИзмерения);
			Данные.Вставить("Количество", 0);
			Данные.Вставить("Спецификация", СтрокаПродукции.Спецификация);
			Данные.Вставить("Высота", ЗначениеПараметраХарактеристики(
				СтрокаПродукции.Характеристика,"Высота"));
			Данные.Вставить("Ширина", ЗначениеПараметраХарактеристики(
				СтрокаПродукции.Характеристика,"Ширина"));
			СводныеДанные.Вставить(Ключ, Данные);
		КонецЕсли;
		Данные.Количество = Данные.Количество + СтрокаПродукции.Количество;
	КонецЦикла;
	
	Номер = 0;
	Для Каждого ПараДанных Из СводныеДанные Цикл
		Номер = Номер + 1;
		ПараДанных.Значение.Вставить("Номер", Номер);
		ДанныеЛиста.Продукция.Добавить(ПараДанных.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыЛиста(ДанныеЛиста, ОбъектЭтапа)
	
	Если Не ДанныеЛиста.Настройка.ВыводитьМатериалы Тогда
		Возврат;
	КонецЕсли;
	
	СводныеДанные = Новый Соответствие;
	КлючиПолуфабрикатов = ПолучитьКлючиПолуфабрикатов(ОбъектЭтапа.Ссылка);
	Для Каждого СтрокаМатериала Из ОбъектЭтапа.ОбеспечениеМатериаламиИРаботами Цикл
		Если Не ЗначениеЗаполнено(СтрокаМатериала.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ПроизводимыйМатериал = КлючиПолуфабрикатов.Получить(
			КлючНоменклатурыХарактеристики(
				СтрокаМатериала.Номенклатура,
				СтрокаМатериала.Характеристика)) <> Неопределено;
		Ключ = ?(ПроизводимыйМатериал, "P|", "B|") + КлючАгрегации(
			СтрокаМатериала.Номенклатура,
			СтрокаМатериала.Характеристика,
			СтрокаМатериала.Спецификация);
		Данные = СводныеДанные.Получить(Ключ);
		Если Данные = Неопределено Тогда
			Данные = Новый Структура;
			Данные.Вставить("Ключ", Ключ);
			Данные.Вставить("Код", СтрокаМатериала.Номенклатура.Код);
			Данные.Вставить("Артикул", СтрокаМатериала.Номенклатура.Артикул);
			Данные.Вставить("Номенклатура", ПредставлениеНоменклатуры(
				СтрокаМатериала.Номенклатура,
				СтрокаМатериала.Характеристика));
			Данные.Вставить("Единица", СтрокаМатериала.Номенклатура.ЕдиницаИзмерения);
			Данные.Вставить("Количество", 0);
			Данные.Вставить("КоличествоНа1", 0);
			Данные.Вставить("Производимый", ПроизводимыйМатериал);
			Данные.Вставить("Спецификация", СтрокаМатериала.Спецификация);
			Данные.Вставить("КомментарийСпецификации", Строка(СтрокаМатериала.Спецификация));
			Данные.Вставить("Высота", ЗначениеПараметраХарактеристики(
				СтрокаМатериала.Характеристика,"Высота"));
			Данные.Вставить("Ширина", ЗначениеПараметраХарактеристики(
				СтрокаМатериала.Характеристика,"Ширина"));
			Данные.Вставить("КромлениеПоВысоте", ЗначениеПараметраХарактеристики(
				СтрокаМатериала.Характеристика,"КромлениеПоВысоте"));
			Данные.Вставить("КромлениеПоШирине", ЗначениеПараметраХарактеристики(
				СтрокаМатериала.Характеристика,"КромлениеПоШирине"));
			СводныеДанные.Вставить(Ключ, Данные);
		КонецЕсли;
		Данные.Количество = Данные.Количество + СтрокаМатериала.Количество;
	КонецЦикла;
	
	Для Каждого ПараДанных Из СводныеДанные Цикл
		ПараДанных.Значение.КоличествоНа1 = КоличествоНаЕдиницу(
			ПараДанных.Значение.Количество,
			ДанныеЛиста.Продукция);
		ДанныеЛиста.Материалы.Добавить(ПараДанных.Значение);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКлючиПолуфабрикатов(СсылкаЭтапа)
	
	Результат = Новый Соответствие;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ВыходныеИзделия.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделия
	|ГДЕ
	|	ВыходныеИзделия.ЭтапПотребитель = &ЭтапПотребитель
	|	И НЕ ВыходныеИзделия.Отменено
	|	И НЕ ВыходныеИзделия.Ссылка.ПометкаУдаления");
	Запрос.УстановитьПараметр("ЭтапПотребитель", СсылкаЭтапа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(
			КлючНоменклатурыХарактеристики(
				Выборка.Номенклатура,
				Выборка.Характеристика),
			Истина);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьВидыРаботЛиста(ДанныеЛиста, ОбъектЭтапа)
	
	Если Не ДанныеЛиста.Настройка.ВыводитьВидыРабот Тогда
		Возврат;
	КонецЕсли;
	
	СводныеДанные = Новый Соответствие;
	Для Каждого СтрокаРаботы Из ОбъектЭтапа.Трудозатраты Цикл
		Если СтрокаРаботы.Отменено
			Или Не ЗначениеЗаполнено(СтрокаРаботы.ВидРабот)
			Или СтрокаРаботы.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Данные = СводныеДанные.Получить(СтрокаРаботы.ВидРабот);
		Если Данные = Неопределено Тогда
			Данные = Новый Структура;
			Данные.Вставить("Ключ", Строка(СтрокаРаботы.ВидРабот.УникальныйИдентификатор()));
			Данные.Вставить("Код", СтрокаРаботы.ВидРабот.Код);
			Данные.Вставить("Наименование", Строка(СтрокаРаботы.ВидРабот));
			Данные.Вставить("Единица", СтрокаРаботы.ВидРабот.ЕдиницаИзмерения);
			Данные.Вставить("Количество", 0);
			СводныеДанные.Вставить(СтрокаРаботы.ВидРабот, Данные);
		КонецЕсли;
		Данные.Количество = Данные.Количество + СтрокаРаботы.Количество;
	КонецЦикла;
	
	Номер = 0;
	Для Каждого ПараДанных Из СводныеДанные Цикл
		Номер = Номер + 1;
		ПараДанных.Значение.Вставить("Номер", Номер);
		ДанныеЛиста.ВидыРабот.Добавить(ПараДанных.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПередачуЛиста(ДанныеЛиста, ОбъектЭтапа)
	
	СводныеДанные = Новый Соответствие;
	Для Каждого СтрокаПродукции Из ОбъектЭтапа.ВыходныеИзделия Цикл
		Если СтрокаПродукции.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		Получатель = ПолучательПередачи(ОбъектЭтапа, СтрокаПродукции);
		
		Ключ = Строка(Получатель) + "|" + КлючАгрегации(
			СтрокаПродукции.Номенклатура,
			СтрокаПродукции.Характеристика,
			СтрокаПродукции.Спецификация);
		Данные = СводныеДанные.Получить(Ключ);
		Если Данные = Неопределено Тогда
			Данные = Новый Структура;
			Данные.Вставить("Ключ", Ключ);
			Данные.Вставить("Получатель", Получатель);
			Данные.Вставить("Код", СтрокаПродукции.Номенклатура.Код);
			Данные.Вставить("Номенклатура", ПредставлениеНоменклатуры(
				СтрокаПродукции.Номенклатура,
				СтрокаПродукции.Характеристика));
			Данные.Вставить("Единица", СтрокаПродукции.Номенклатура.ЕдиницаИзмерения);
			Данные.Вставить("Количество", 0);
			СводныеДанные.Вставить(Ключ, Данные);
		КонецЕсли;
		Данные.Количество = Данные.Количество + СтрокаПродукции.Количество;
	КонецЦикла;
	
	Номер = 0;
	Для Каждого ПараДанных Из СводныеДанные Цикл
		Номер = Номер + 1;
		ПараДанных.Значение.Вставить("Номер", Номер);
		ДанныеЛиста.Передача.Добавить(ПараДанных.Значение);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЭтапыЗаказа(СсылкаЗаказа, Назначения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Этапы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК Этапы
	|ГДЕ
	|	Этапы.Распоряжение = &Заказ
	|	И НЕ Этапы.ПометкаУдаления
	|	И Этапы.Проведен
	|	И (Этапы.Назначение В (&Назначения)
	|		ИЛИ Этапы.НазначениеПродукция В (&Назначения))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этапы.НомерЭтапа");
	Запрос.УстановитьПараметр("Заказ", СсылкаЗаказа);
	Запрос.УстановитьПараметр("Назначения", Назначения);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция СформированыЭтапыДляНазначения(СсылкаЗаказа, Назначение)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Этапы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК Этапы
	|ГДЕ
	|	Этапы.Распоряжение = &Заказ
	|	И НЕ Этапы.ПометкаУдаления
	|	И Этапы.Проведен
	|	И (Этапы.Назначение = &Назначение
	|		ИЛИ Этапы.НазначениеПродукция = &Назначение)");
	Запрос.УстановитьПараметр("Заказ", СсылкаЗаказа);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьНастройкуПечати(ВидДокумента, Подразделение, ВРЦ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Настройки.ВыводитьПродукцию КАК ВыводитьПродукцию,
	|	Настройки.ВыводитьМатериалы КАК ВыводитьМатериалы,
	|	Настройки.МатериалыВПодчиненииПродукции КАК МатериалыВПодчиненииПродукции,
	|	Настройки.ВыводитьВидыРабот КАК ВыводитьВидыРабот,
	|	Настройки.ВидПечатнойФормы КАК ВидПечатнойФормы
	|ИЗ
	|	РегистрСведений.бит_НастройкиПечатиПроизводственныхЗаданий КАК Настройки
	|ГДЕ
	|	Настройки.ВидДокумента = &ВидДокумента
	|	И Настройки.Подразделение = &Подразделение
	|	И (Настройки.ВРЦ = &ВРЦ
	|		ИЛИ Настройки.ВРЦ = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА Настройки.ВРЦ = &ВРЦ ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ");
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ВРЦ", ВРЦ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура(
		"ВыводитьПродукцию, ВыводитьМатериалы, МатериалыВПодчиненииПродукции, ВыводитьВидыРабот, ВидПечатнойФормы",
		Выборка.ВыводитьПродукцию,
		Выборка.ВыводитьМатериалы,
		Выборка.МатериалыВПодчиненииПродукции,
		Выборка.ВыводитьВидыРабот,
		Выборка.ВидПечатнойФормы);
	
КонецФункции

Процедура СообщитьОбОтсутствииНастройки(Подразделение, ВРЦ)
	
	СообщитьПользователюСТекстомЛистаТребований(
		"Для подразделения """ + Строка(Подразделение)
		+ """ и ВРЦ """ + Строка(ВРЦ)
		+ """ не сформирована печатная форма, так как отсутствуют данные в регистре "
		+ "«Настройки печати производственных заданий». Обратитесь к администратору");
	
КонецПроцедуры

#КонецОбласти

#Область ВыводМакетов

Функция ВывестиЛист(ТабличныйДокумент, ДанныеЛиста)
	
	Макет = ПолучитьМакетПечатнойФормы(ИмяМакета(ДанныеЛиста.Настройка.ВидПечатнойФормы));
	Если Макет = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Лист = СформироватьЛистПоМакету(Макет, ДанныеЛиста);
	
	Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	ТабличныйДокумент.Вывести(Лист);
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьЛистПоМакету(Макет, ДанныеЛиста)
	
	ИменаОбластей = ИменаОбластейМакета();
	Лист = Новый ТабличныйДокумент;
	
	ВывестиОбластьМакета(
		Лист,
		Макет,
		ИменаОбластей.Шапка,
		ПараметрыШапки(ДанныеЛиста));
	
	Если ДанныеЛиста.Продукция.Количество() > 0
		Или ДанныеЛиста.Материалы.Количество() > 0 Тогда
		ВывестиОбластьМакета(
			Лист,
			Макет,
			ИменаОбластей.ШапкаПродукции,
			Новый Структура);
		
		ВывестиПродукциюИМатериалы(
			Лист,
			Макет,
			ИменаОбластей,
			ДанныеЛиста);
	КонецЕсли;
	
	Если ДанныеЛиста.ВидыРабот.Количество() > 0 Тогда
		ВывестиОбластьМакета(
			Лист,
			Макет,
			ИменаОбластей.ШапкаРабот,
			Новый Структура);
		Для Каждого ДанныеРаботы Из ДанныеЛиста.ВидыРабот Цикл
			ВывестиСтрокуМакета(
				Лист,
				Макет,
				ИменаОбластей.СтрокаРаботы,
				ПараметрыРаботы(ДанныеРаботы));
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеЛиста.Передача.Количество() > 0 Тогда
		ПередачаПоПолучателям = Новый Соответствие;
		Для Каждого ДанныеПередачи Из ДанныеЛиста.Передача Цикл
			СтрокиПолучателя = ПередачаПоПолучателям.Получить(ДанныеПередачи.Получатель);
			Если СтрокиПолучателя = Неопределено Тогда
				СтрокиПолучателя = Новый Массив;
				ПередачаПоПолучателям.Вставить(
					ДанныеПередачи.Получатель,
					СтрокиПолучателя);
			КонецЕсли;
			СтрокиПолучателя.Добавить(ДанныеПередачи);
		КонецЦикла;
		
		Для Каждого ПараПолучателя Из ПередачаПоПолучателям Цикл
			ПараметрыПолучателя = Новый Структура;
			ПараметрыПолучателя.Вставить(
				"СледПодразделениеРабочийЦентр",
				ПараПолучателя.Ключ);
			ВывестиОбластьМакета(
				Лист,
				Макет,
				ИменаОбластей.ШапкаПередачи,
				ПараметрыПолучателя);
			
			НомерПередачи = 0;
			Для Каждого ДанныеПередачи Из ПараПолучателя.Значение Цикл
				НомерПередачи = НомерПередачи + 1;
				ПараметрыСтрокиПередачи = ПараметрыПередачи(ДанныеПередачи);
				ПараметрыСтрокиПередачи.Вставить("НВП", НомерПередачи);
				ВывестиСтрокуМакета(
					Лист,
					Макет,
					ИменаОбластей.СтрокаПередачи,
					ПараметрыСтрокиПередачи);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Лист;
	
КонецФункции

Процедура ВывестиПродукциюИМатериалы(Лист, Макет, ИменаОбластей, ДанныеЛиста)
	
	ОбработанныеМатериалы = Новый Массив;
	Для Каждого ДанныеПродукции Из ДанныеЛиста.Продукция Цикл
		ВывестиСтрокуМакета(
			Лист,
			Макет,
			ИменаОбластей.СтрокаПродукции,
			ПараметрыПродукции(ДанныеПродукции));
		
		ВывестиМатериалыПродукции(
			Лист,
			Макет,
			ИменаОбластей,
			ДанныеЛиста.Материалы,
			ДанныеПродукции.Спецификация,
			Истина,
			ОбработанныеМатериалы);
		
		Если ДанныеЛиста.Настройка.МатериалыВПодчиненииПродукции Тогда
			КоличествоПокупных = КоличествоМатериаловПродукции(
				ДанныеЛиста.Материалы,
				ДанныеПродукции.Спецификация,
				Ложь,
				ОбработанныеМатериалы);
			Если КоличествоПокупных > 0 Тогда
				ВывестиРазделительМатериалов(Лист, Макет, ИменаОбластей);
				ВывестиМатериалыПродукции(
					Лист,
					Макет,
					ИменаОбластей,
					ДанныеЛиста.Материалы,
					ДанныеПродукции.Спецификация,
					Ложь,
					ОбработанныеМатериалы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВывестиНеобработанныеМатериалы(
		Лист,
		Макет,
		ИменаОбластей,
		ДанныеЛиста.Материалы,
		Истина,
		ОбработанныеМатериалы);
	
	Если КоличествоНеобработанныхМатериалов(
			ДанныеЛиста.Материалы,
			Ложь,
			ОбработанныеМатериалы) > 0 Тогда
		ВывестиРазделительМатериалов(Лист, Макет, ИменаОбластей);
		ВывестиНеобработанныеМатериалы(
			Лист,
			Макет,
			ИменаОбластей,
			ДанныеЛиста.Материалы,
			Ложь,
			ОбработанныеМатериалы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиМатериалыПродукции(
		Лист,
		Макет,
		ИменаОбластей,
		Материалы,
		Спецификация,
		Производимый,
		ОбработанныеМатериалы)
	
	Для ИндексМатериала = 0 По Материалы.Количество() - 1 Цикл
		Если ОбработанныеМатериалы.Найти(ИндексМатериала) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеМатериала = Материалы[ИндексМатериала];
		Если ДанныеМатериала.Производимый <> Производимый
			Или ДанныеМатериала.Спецификация <> Спецификация Тогда
			Продолжить;
		КонецЕсли;
		
		ВывестиСтрокуМакета(
			Лист,
			Макет,
			ИменаОбластей.СтрокаМатериала,
			ПараметрыМатериала(ДанныеМатериала));
		ОбработанныеМатериалы.Добавить(ИндексМатериала);
	КонецЦикла;
	
КонецПроцедуры

Функция КоличествоМатериаловПродукции(
		Материалы,
		Спецификация,
		Производимый,
		ОбработанныеМатериалы)
	
	Количество = 0;
	Для ИндексМатериала = 0 По Материалы.Количество() - 1 Цикл
		Если ОбработанныеМатериалы.Найти(ИндексМатериала) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеМатериала = Материалы[ИндексМатериала];
		Если ДанныеМатериала.Производимый = Производимый
			И ДанныеМатериала.Спецификация = Спецификация Тогда
			Количество = Количество + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

Процедура ВывестиНеобработанныеМатериалы(
		Лист,
		Макет,
		ИменаОбластей,
		Материалы,
		Производимый,
		ОбработанныеМатериалы)
	
	Для ИндексМатериала = 0 По Материалы.Количество() - 1 Цикл
		Если ОбработанныеМатериалы.Найти(ИндексМатериала) <> Неопределено
			Или Материалы[ИндексМатериала].Производимый <> Производимый Тогда
			Продолжить;
		КонецЕсли;
		ВывестиСтрокуМакета(
			Лист,
			Макет,
			ИменаОбластей.СтрокаМатериала,
			ПараметрыМатериала(Материалы[ИндексМатериала]));
		ОбработанныеМатериалы.Добавить(ИндексМатериала);
	КонецЦикла;
	
КонецПроцедуры

Функция КоличествоНеобработанныхМатериалов(
		Материалы,
		Производимый,
		ОбработанныеМатериалы)
	
	Количество = 0;
	Для ИндексМатериала = 0 По Материалы.Количество() - 1 Цикл
		Если ОбработанныеМатериалы.Найти(ИндексМатериала) = Неопределено
			И Материалы[ИндексМатериала].Производимый = Производимый Тогда
			Количество = Количество + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

Процедура ВывестиРазделительМатериалов(Лист, Макет, ИменаОбластей)
	
	Если ПустаяСтрока(ИменаОбластей.РазделительМатериалов) Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиОбластьМакета(
		Лист,
		Макет,
		ИменаОбластей.РазделительМатериалов,
		Новый Структура);
	
КонецПроцедуры

Процедура ВывестиСтрокуМакета(
		Лист,
		Макет,
		ИмяОбласти,
		Параметры)
	
	ВывестиОбластьМакета(
		Лист,
		Макет,
		ИмяОбласти,
		Параметры);
	
КонецПроцедуры

Процедура ВывестиОбластьМакета(
		Лист,
		Макет,
		ИмяОбласти,
		Параметры)
	
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
	КартинкаШтрихКода = Неопределено;
	Если Параметры.Свойство("ШтрихКод", КартинкаШтрихКода) Тогда
		Параметры.Удалить("ШтрихКод");
	КонецЕсли;
	ОбластьМакета.Параметры.Заполнить(Параметры);
	
	Если КартинкаШтрихКода <> Неопределено Тогда
		ОбластьМакета.Рисунки.QR.Картинка = КартинкаШтрихКода;
	КонецЕсли;
	
	Лист.Вывести(ОбластьМакета);
	
КонецПроцедуры

Функция ИменаОбластейМакета()
	
	Возврат Новый Структура(
		"Шапка, ШапкаПродукции, СтрокаПродукции, СтрокаМатериала, "
		+ "РазделительМатериалов, ШапкаРабот, СтрокаРаботы, "
		+ "ШапкаПередачи, СтрокаПередачи",
		"Шапка",
		"ШапкаПродукцияМатериалы",
		"Продукция",
		"Материалы",
		"",
		"ШапкаВидыРабот",
		"ВидыРабот",
		"ШапкаПередатьНа",
		"ПередатНаПродукция");
	
КонецФункции

Функция КартинкаQRКода(QRСтрока)
	
	Если ПустаяСтрока(QRСтрока) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ДвоичныеДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 0, 190);
		Если ДвоичныеДанныеQRКода = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Новый Картинка(ДвоичныеДанныеQRКода);
	Исключение
		СообщитьПользователюСТекстомЛистаТребований("Не удалось сформировать QR-код: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьМакетПечатнойФормы(ИмяМакета)
	
	Попытка
		Возврат УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	Исключение
		СообщитьПользователюСТекстомЛистаТребований("Не удалось прочитать макет """ + ИмяМакета + """: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ИмяМакета(ВидПечатнойФормы)
	
	Если ВидПечатнойФормы = Перечисления.бит_ТипыПечатныхФормЗаказаНаПроизводство.МалярныйЦех Тогда
		Возврат "ОбщийМакет.бит_ПФ_МалярныйЦех";
	ИначеЕсли ВидПечатнойФормы = Перечисления.бит_ТипыПечатныхФормЗаказаНаПроизводство.СборкаФурнитуры Тогда
		Возврат "ОбщийМакет.бит_ПФ_Фурнитура";
	КонецЕсли;
	
	Возврат "ОбщийМакет.бит_ПФ_Основная";
	
КонецФункции

Функция ПараметрыШапки(ДанныеЛиста)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ЗаказНаПроизводство", Строка(ДанныеЛиста.Заказ));
	Параметры.Вставить(
		"ПодразделениеРабочийЦентр",
		Строка(ДанныеЛиста.Подразделение) + "/" + Строка(ДанныеЛиста.ВРЦ));
	Параметры.Вставить(
		"ДатаИсполнения",
		Формат(ДанныеЛиста.ДатаИсполнения, "ДФ=dd.MM.yyyy"));
	Параметры.Вставить("Комментарий", ДанныеЛиста.Комментарий);
	Параметры.Вставить("ШтрихКод", КартинкаQRКода(ДанныеЛиста.QR));
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыПродукции(Данные)
	
	Параметры = Новый Структура;
	Параметры.Вставить("НВП", Данные.Номер);
	Параметры.Вставить("КодВП", Данные.Код);
	Параметры.Вставить("АртикулВП", Данные.Артикул);
	Параметры.Вставить("НоменклатураХарактеристикаВП", Данные.Номенклатура);
	Параметры.Вставить("НоменклатураХарактеристикаГП", Данные.Номенклатура);
	Параметры.Вставить("ЕдИзмВП", Данные.Единица);
	Параметры.Вставить("КолВП", Данные.Количество);
	Параметры.Вставить("ВысотаВП", Данные.Высота);
	Параметры.Вставить("ШиринаВП", Данные.Ширина);
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыМатериала(Данные)
	
	Параметры = Новый Структура;
	Параметры.Вставить("КодМатериала", Данные.Код);
	Параметры.Вставить("АртикулМат", Данные.Артикул);
	Параметры.Вставить("НоменклатураХарактеристикаМатериала", Данные.Номенклатура);
	Параметры.Вставить("КомментарийСпецификации", Данные.КомментарийСпецификации);
	Параметры.Вставить("КромлениеПоВысоте", Данные.КромлениеПоВысоте);
	Параметры.Вставить("Высота", Данные.Высота);
	Параметры.Вставить("КромлениеПоШирине", Данные.КромлениеПоШирине);
	Параметры.Вставить("Ширина", Данные.Ширина);
	Параметры.Вставить("КолНа1", Данные.КоличествоНа1);
	Параметры.Вставить("ЕдИзмМат", Данные.Единица);
	Параметры.Вставить("КолМат", Данные.Количество);
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыРаботы(Данные)
	
	Параметры = Новый Структура;
	Параметры.Вставить("НВР", Данные.Номер);
	Параметры.Вставить("КодВР", Данные.Код);
	Параметры.Вставить("НаименованиеВР", Данные.Наименование);
	Параметры.Вставить("ЕдИзмВР", Данные.Единица);
	Параметры.Вставить("КолВР", Данные.Количество);
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыПередачи(Данные)
	
	Параметры = Новый Структура;
	Параметры.Вставить("НВП", Данные.Номер);
	Параметры.Вставить("КодВП", Данные.Код);
	Параметры.Вставить("НоменклатураХарактеристикаВП", Данные.Номенклатура);
	Параметры.Вставить("ЕдИзмВП", Данные.Единица);
	Параметры.Вставить("КолВП", Данные.Количество);
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеФункции

Функция НоменклатураВАгрегационномСегменте(Номенклатура, Характеристика)

	
	Сегменты = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений
	(Справочники.бит_ЗначенияПоУмолчанию.СегментыНоменклатурыДляАгрегацииВЗаказНаПроизводство);
	
	Если Сегменты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Найдено
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	НоменклатураСегмента.Сегмент В (&Сегменты)
	|	И НоменклатураСегмента.Номенклатура = &Номенклатура
	|	И (НоменклатураСегмента.Характеристика = &Характеристика
	|		ИЛИ НоменклатураСегмента.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))");
	Запрос.УстановитьПараметр("Сегменты", Сегменты);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ИсключенаПечать(Подразделение, ВРЦ)
	
	Исключения = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений
	(Справочники.бит_ЗначенияПоУмолчанию.НеПечататьИзЗаказаНаПроизводствоДляПодразделенийИВРЦ); 
	
	Возврат Исключения.Найти(Подразделение) <> Неопределено
		Или Исключения.Найти(ВРЦ) <> Неопределено;
	
КонецФункции

Функция ЗначениеПараметраХарактеристики(Характеристика, НаименованиеНастройки)
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		Возврат "";
	КонецЕсли;
	
	Реквизит = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений
	(Справочники.бит_ЗначенияПоУмолчанию[НаименованиеНастройки], , Истина);;
	Если Реквизит = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат УправлениеСвойствами.ЗначениеСвойства(Характеристика, Реквизит);
	
КонецФункции

Функция ОсновнойВидРабочегоЦентра(ОбъектЭтапа)
	
	Для Каждого СтрокаВРЦ Из ОбъектЭтапа.ВидыРабочихЦентров Цикл
		Если СтрокаВРЦ.Использовать Тогда
			Возврат СтрокаВРЦ.ВидРабочегоЦентра;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбъектЭтапа.ВидыРабочихЦентров.Количество() > 0 Тогда
		Возврат ОбъектЭтапа.ВидыРабочихЦентров[0].ВидРабочегоЦентра;
	КонецЕсли;
	
	Возврат Справочники.ВидыРабочихЦентров.ПустаяСсылка();
	
КонецФункции

Функция ПолучательПередачи(ОбъектЭтапа, СтрокаПродукции)
	
	СсылкаСледующегоЭтапа = СтрокаПродукции.ЭтапПотребитель;
	Если Не ЗначениеЗаполнено(СсылкаСледующегоЭтапа) Тогда
		СсылкаСледующегоЭтапа = НайтиСледующийЭтап(
			ОбъектЭтапа,
			СтрокаПродукции.Номенклатура,
			СтрокаПродукции.Характеристика,
			СтрокаПродукции.Назначение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаСледующегоЭтапа) Тогда
		СледующийЭтап = СсылкаСледующегоЭтапа.ПолучитьОбъект();
		Возврат ПредставлениеПодразделенияВРЦ(
			СледующийЭтап.Подразделение,
			ОсновнойВидРабочегоЦентра(СледующийЭтап));
	КонецЕсли;
	
	Возврат Строка(СтрокаПродукции.Получатель);
	
КонецФункции

Функция НайтиСледующийЭтап(
		ОбъектЭтапа,
		Номенклатура,
		Характеристика,
		Назначение)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Обеспечение.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК Обеспечение
	|ГДЕ
	|	Обеспечение.Ссылка.Распоряжение = &Распоряжение
	|	И Обеспечение.Ссылка <> &ТекущийЭтап
	|	И Обеспечение.Ссылка.НомерЭтапа > &НомерТекущегоЭтапа
	|	И Обеспечение.Ссылка.Проведен
	|	И НЕ Обеспечение.Ссылка.ПометкаУдаления
	|	И НЕ Обеспечение.Отменено
	|	И Обеспечение.Номенклатура = &Номенклатура
	|	И Обеспечение.Характеристика = &Характеристика
	|	И Обеспечение.Назначение = &Назначение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Обеспечение.Ссылка.НомерЭтапа");
	Запрос.УстановитьПараметр("Распоряжение", ОбъектЭтапа.Распоряжение);
	Запрос.УстановитьПараметр("ТекущийЭтап", ОбъектЭтапа.Ссылка);
	Запрос.УстановитьПараметр("НомерТекущегоЭтапа", ОбъектЭтапа.НомерЭтапа);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ЭтапПроизводства2_2.ПустаяСсылка();
	
КонецФункции

Функция ПредставлениеПодразделенияВРЦ(Подразделение, ВРЦ)
	
	ПредставлениеПодразделения = Строка(Подразделение);
	ПредставлениеВРЦ = Строка(ВРЦ);
	Если ПустаяСтрока(ПредставлениеПодразделения) Тогда
		Возврат ПредставлениеВРЦ;
	ИначеЕсли ПустаяСтрока(ПредставлениеВРЦ) Тогда
		Возврат ПредставлениеПодразделения;
	КонецЕсли;
	
	Возврат ПредставлениеПодразделения + "/" + ПредставлениеВРЦ;
	
КонецФункции

Функция СоставГруппыЗаказа(ОбъектЗаказ, КлючГруппировки)
	
	Возврат ОбъектЗаказ.бит_СоставГруппировокПечатиБегунков.НайтиСтроки(
		Новый Структура("КлючГруппировки", КлючГруппировки));
	
КонецФункции

Функция ВыбранныеГруппыЗаказа(ОбъектЗаказ, КлючиГруппировок)
	
	Результат = Новый Массив;
	Если КлючиГруппировок.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ГруппаПечати Из ОбъектЗаказ.бит_ГруппировкиПечатиБегунков Цикл
		Если КлючиГруппировок.Найти(ГруппаПечати.КлючГруппировки) <> Неопределено Тогда
			Результат.Добавить(ГруппаПечати);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КлючиГруппировокИзПараметров(ПараметрыПечати)
	
	Результат = Новый Массив;
	Если ПараметрыПечати = Неопределено
		Или ТипЗнч(ПараметрыПечати) <> Тип("Структура") Тогда
		Возврат Результат;
	КонецЕсли;
	
	КлючиГруппировок = Неопределено;
	Если Не ПараметрыПечати.Свойство("бит_КлючиГруппировок", КлючиГруппировок)
		Или КлючиГруппировок = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого КлючГруппировки Из КлючиГруппировок Цикл
		Результат.Добавить(КлючГруппировки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СигнатураСтрокГруппировки(СтрокиГруппировки)
	
	Сигнатуры = Новый ТаблицаЗначений;
	Сигнатуры.Колонки.Добавить("Сигнатура");
	Для Каждого СтрокаГруппы Из СтрокиГруппировки Цикл
		НоваяСтрока = Сигнатуры.Добавить();
		НоваяСтрока.Сигнатура = ЗначениеВСтрокуВнутр(СтрокаГруппы.Номенклатура)
			+ "|" + ЗначениеВСтрокуВнутр(СтрокаГруппы.Характеристика)
			+ "|" + ЗначениеВСтрокуВнутр(СтрокаГруппы.Спецификация)
			+ "|" + ЗначениеВСтрокуВнутр(СтрокаГруппы.Назначение)
			+ "|" + Формат(СтрокаГруппы.Количество, "ЧГ=0")
			+ "|" + Формат(СтрокаГруппы.ДатаПотребности, "ДФ=yyyyMMddHHmmss");
	КонецЦикла;
	Сигнатуры.Сортировать("Сигнатура");
	
	Результат = "";
	Для Каждого СтрокаСигнатуры Из Сигнатуры Цикл
		Результат = Результат
			+ ?(ПустаяСтрока(Результат), "", Символы.ПС)
			+ СтрокаСигнатуры.Сигнатура;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция QRСтрокаЗаказа(ОбъектЗаказ, ГруппаПечати, Подразделение, ВРЦ)
	
	QR = ОбъектЗаказ.Номер
		+ "|" + Формат(ОбъектЗаказ.Дата, "ДФ=yyyyMMdd")
		+ "|" + Подразделение.Код
		+ "|" + ВРЦ.бит_КодВРЦ;
	
	Если Не ГруппаПечати.АгрегированнаяНоменклатура Тогда
		Состав = СоставГруппыЗаказа(ОбъектЗаказ, ГруппаПечати.КлючГруппировки);
		Если Состав.Количество() = 0 Тогда
			ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
				"Не найден состав группировки для формирования QR-кода.");
		КонецЕсли;
		
		СтрокаСостава = Состав[0];
		QR = QR
			+ "|" + СтрокаСостава.Номенклатура.Код
			// {{ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] +
			// У характеристик номенклатуры типовой код пустой (длина кода = 0), поэтому
			// в QR транслируется значение реквизита "(бит) Код характеристики".
			+ "|" + Формат(СтрокаСостава.Характеристика.бит_КодХарактеристики, "ЧГ=0")
			// }}ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] -
			+ "|" + СтрокаСостава.Спецификация.Код;
	КонецЕсли;
	
	Возврат QR;
	
КонецФункции

Функция РазобратьСтрокуQR(QRСтрока) Экспорт
	
	Если ПустаяСтрока(QRСтрока) Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований("Пустая строка QR-кода.");
	КонецЕсли;
	
	ЧастиQR = СтрРазделить(QRСтрока, "|", Истина);
	КоличествоЧастей = ЧастиQR.Количество();
	// {{ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] +
	// Форматы QR-кода:
	//   4 части - печать из заказа по агрегированной по сегменту номенклатуре;
	//   5 частей - печать из документа "Этап производства" (последняя часть - идентификатор этапа);
	//   7 частей - печать из заказа по набору "Номенклатура + Характеристика + Спецификация".
	Если КоличествоЧастей <> 4 И КоличествоЧастей <> 5 И КоличествоЧастей <> 7 Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"Неверный формат QR-кода. Ожидается 4, 5 или 7 частей.");
	КонецЕсли;

	ДатаЗаказа = ДатаИзСтрокиQR(ЧастиQR[1]);
	АгрегированнаяНоменклатура = КоличествоЧастей = 4;
	ПечатьИзЭтапа = КоличествоЧастей = 5;
	// }}ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] -

	Результат = Новый Структура;
	Результат.Вставить("ЗаказНаПроизводство"		, НайтиЗаказНаПроизводствоПоНомеруИДате(ЧастиQR[0], ДатаЗаказа));
	Результат.Вставить("ДатаЗаказа"					, ДатаЗаказа);
	Результат.Вставить("Подразделение"				, НайтиЕдинственнуюСсылкуПоПолю("Справочник.СтруктураПредприятия",
																		"Код",
																		ЧастиQR[2],
																		"элемент справочника ""Структура предприятия"""));
	Результат.Вставить("ВидРабочегоЦентра"			, НайтиЕдинственнуюСсылкуПоПолю("Справочник.ВидыРабочихЦентров",
																		"бит_КодВРЦ",
																		ЧастиQR[3],
																		"элемент справочника ""Виды рабочих центров"""));
	Результат.Вставить("Номенклатура"				, Справочники.Номенклатура.ПустаяСсылка());
	Результат.Вставить("Характеристика"				, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Результат.Вставить("Спецификация"				, Справочники.РесурсныеСпецификации.ПустаяСсылка());
	Результат.Вставить("АгрегированнаяНоменклатура"	, АгрегированнаяНоменклатура);
	// {{ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] +
	// Для QR из документа "Этап производства" возвращается сам этап, поля номенклатуры остаются пустыми.
	Результат.Вставить("Этап"						, Документы.ЭтапПроизводства2_2.ПустаяСсылка());
	Результат.Вставить("ПечатьИзЭтапа"				, ПечатьИзЭтапа);

	Если ПечатьИзЭтапа Тогда

		Результат.Этап = НайтиЭтапПоИдентификатору(ЧастиQR[4]);

	ИначеЕсли Не АгрегированнаяНоменклатура Тогда
	// }}ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] -

		Результат.Номенклатура = НайтиЕдинственнуюСсылкуПоПолю("Справочник.Номенклатура",
																"Код",
																ЧастиQR[4],
																"элемент справочника ""Номенклатура""");
		// {{ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] +
		// Характеристика ищется по реквизиту "(бит) Код характеристики" (типовой код пустой).
		Результат.Характеристика = НайтиЕдинственнуюСсылкуПоПолю("Справочник.ХарактеристикиНоменклатуры",
																"бит_КодХарактеристики",
																ЧастиQR[5],
																"элемент справочника ""Характеристики номенклатуры""",
																Истина);
		// }}ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] -
		Результат.Спецификация = НайтиЕдинственнуюСсылкуПоПолю("Справочник.РесурсныеСпецификации",
																"Код",
																ЧастиQR[6],
																"элемент справочника ""Спецификация""");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// {{ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] +
// Возвращает этап производства по идентификатору из QR-кода, напечатанного из этапа.
//
Функция НайтиЭтапПоИдентификатору(СтрокаИдентификатора)

	Если ПустаяСтрока(СтрокаИдентификатора) Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"В QR-коде не заполнен идентификатор этапа производства.");
	КонецЕсли;

	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СокрЛП(СтрокаИдентификатора));
	Исключение
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"Не удалось распознать идентификатор этапа производства из QR-кода.");
	КонецПопытки;

	СсылкаЭтапа = Документы.ЭтапПроизводства2_2.ПолучитьСсылку(Идентификатор);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Этапы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК Этапы
	|ГДЕ
	|	Этапы.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаЭтапа);

	Если Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"Не найден этап производства по данным QR-кода.");
	КонецЕсли;

	Возврат СсылкаЭтапа;

КонецФункции
// }}ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [16.07.2026] -

Функция ДатаИзСтрокиQR(СтрокаДаты)
	
	Если СтрДлина(СтрокаДаты) <> 8 Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"Не удалось распознать дату заказа из QR-кода.");
	КонецЕсли;
	
	Попытка
		Возврат Дата(
			Число(Лев(СтрокаДаты, 4)),
			Число(Сред(СтрокаДаты, 5, 2)),
			Число(Прав(СтрокаДаты, 2)));
	Исключение
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"Не удалось распознать дату заказа из QR-кода.");
	КонецПопытки;
	
КонецФункции

Функция НайтиЗаказНаПроизводствоПоНомеруИДате(НомерЗаказа, ДатаЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство2_2.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	|ГДЕ
	|	ЗаказНаПроизводство2_2.Номер = &Номер
	|	И ЗаказНаПроизводство2_2.Дата МЕЖДУ &НачалоДня И &КонецДня";
	Запрос.УстановитьПараметр("Номер", НомерЗаказа);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаЗаказа));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ДатаЗаказа));
	
	Возврат ЕдинственнаяСсылкаИзЗапроса(
		Запрос,
		"заказ на производство");
	
КонецФункции

Функция НайтиЕдинственнуюСсылкуПоПолю(ИмяТаблицы, ИмяПоля, ЗначениеПоля, ПредставлениеОбъекта, ЗначениеЧисловое = Ложь)

	Если ПустаяСтрока(ЗначениеПоля) Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"В QR-коде не заполнен код для поиска: " + ПредставлениеОбъекта + ".");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Объекты.Ссылка КАК Ссылка
	|ИЗ
	|	" + ИмяТаблицы + " КАК Объекты
	|ГДЕ
	|	Объекты." + ИмяПоля + " = &ЗначениеПоля";
	// {{ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] +
	// Код характеристики - число, поэтому для него значение приводится к числу.
	Если ЗначениеЧисловое Тогда
		Запрос.УстановитьПараметр("ЗначениеПоля", Число(ЗначениеПоля));
	Иначе
		Запрос.УстановитьПараметр("ЗначениеПоля", ЗначениеПоля);
	КонецЕсли;
	// }}ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] -
	
	Возврат ЕдинственнаяСсылкаИзЗапроса(
		Запрос,
		ПредставлениеОбъекта);
	
КонецФункции

Функция ЕдинственнаяСсылкаИзЗапроса(Запрос, ПредставлениеОбъекта)
	
	ТаблицаСсылок = Запрос.Выполнить().Выгрузить();
	Если ТаблицаСсылок.Количество() = 0 Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"Не найден " + ПредставлениеОбъекта + " по данным QR-кода.");
	ИначеЕсли ТаблицаСсылок.Количество() > 1 Тогда
		ВызватьИсключение ТекстСообщенияСТекстомЛистаТребований(
			"По данным QR-кода найдено несколько объектов: " + ПредставлениеОбъекта + ".");
	КонецЕсли;
	
	Возврат ТаблицаСсылок[0].Ссылка;
	
КонецФункции

Функция QRСтрокаЭтапа(ОбъектЭтапа, ВРЦ)
	
	Заказ = ОбъектЭтапа.Распоряжение;
	Возврат Заказ.Номер
		+ "|" + Формат(Заказ.Дата, "ДФ=yyyyMMdd")
		+ "|" + ОбъектЭтапа.Подразделение.Код
		+ "|" + ВРЦ.бит_КодВРЦ
		+ "|" + Строка(ОбъектЭтапа.Ссылка.УникальныйИдентификатор());
	
КонецФункции

Функция МинимальнаяДатаГруппы(ОбъектЗаказ, СоставГруппы)
	
	МинимальнаяДата = Дата(1, 1, 1);
	Для Каждого СтрокаСостава Из СоставГруппы Цикл
		СтрокаПродукции = ОбъектЗаказ.Продукция.Найти(СтрокаСостава.НомерСтрокиПродукции, "НомерСтроки");
		Если СтрокаПродукции <> Неопределено
			И ЗначениеЗаполнено(СтрокаПродукции.ДатаПотребности)
			И (МинимальнаяДата = Дата(1, 1, 1)
				Или СтрокаПродукции.ДатаПотребности < МинимальнаяДата) Тогда
			МинимальнаяДата = СтрокаПродукции.ДатаПотребности;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МинимальнаяДата;
	
КонецФункции

Функция МинимальнаяДатаЭтапа(ОбъектЭтапа)
	
	МинимальнаяДата = ОбъектЭтапа.ДатаПроизводства;
	Для Каждого СтрокаПродукции Из ОбъектЭтапа.ВыходныеИзделия Цикл
		Если ЗначениеЗаполнено(СтрокаПродукции.ДатаПроизводства)
			И (Не ЗначениеЗаполнено(МинимальнаяДата)
				Или СтрокаПродукции.ДатаПроизводства < МинимальнаяДата) Тогда
			МинимальнаяДата = СтрокаПродукции.ДатаПроизводства;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МинимальнаяДата;
	
КонецФункции

Функция КоличествоНаЕдиницу(КоличествоМатериала, Продукция)
	
	КоличествоПродукции = 0;
	Для Каждого СтрокаПродукции Из Продукция Цикл
		КоличествоПродукции = КоличествоПродукции + СтрокаПродукции.Количество;
	КонецЦикла;
	
	Возврат ?(
		КоличествоПродукции = 0,
		0,
		Окр(КоличествоМатериала / КоличествоПродукции, 2));
	
КонецФункции

Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика)
	
	Возврат Строка(Номенклатура)
		+ ?(ЗначениеЗаполнено(Характеристика), ";" + Строка(Характеристика), "");
	
КонецФункции

Функция КлючАгрегации(Номенклатура, Характеристика, Спецификация)
	
	Возврат КлючНоменклатурыХарактеристики(Номенклатура, Характеристика)
		+ "|" + Строка(Спецификация.УникальныйИдентификатор());
	
КонецФункции

Функция КлючНоменклатурыХарактеристики(Номенклатура, Характеристика)
	
	Возврат Строка(Номенклатура.УникальныйИдентификатор())
		+ "|" + Строка(Характеристика.УникальныйИдентификатор());
	
КонецФункции

Функция КлючПодразделенияВРЦ(Подразделение, ВРЦ)
	
	Возврат Строка(Подразделение.УникальныйИдентификатор())
		+ "|" + Строка(ВРЦ.УникальныйИдентификатор());
	
КонецФункции

Процедура СвернутьДанныеЛиста(ДанныеЛиста)
	
	ДанныеЛиста.Продукция = СвернутьМассивДанных(ДанныеЛиста.Продукция);
	ДанныеЛиста.Материалы = СвернутьМассивДанных(ДанныеЛиста.Материалы);
	ДанныеЛиста.ВидыРабот = СвернутьМассивДанных(ДанныеЛиста.ВидыРабот);
	ДанныеЛиста.Передача = СвернутьМассивДанных(ДанныеЛиста.Передача);
	
	ПеренумероватьМассив(ДанныеЛиста.Продукция);
	ПеренумероватьМассив(ДанныеЛиста.ВидыРабот);
	
	Для Каждого ДанныеМатериала Из ДанныеЛиста.Материалы Цикл
		ДанныеМатериала.КоличествоНа1 = КоличествоНаЕдиницу(
			ДанныеМатериала.Количество,
			ДанныеЛиста.Продукция);
	КонецЦикла;
	
КонецПроцедуры

Функция СвернутьМассивДанных(ИсходныеДанные)
	
	СводныеДанные = Новый Соответствие;
	Для Каждого Данные Из ИсходныеДанные Цикл
		Сводные = СводныеДанные.Получить(Данные.Ключ);
		Если Сводные = Неопределено Тогда
			Сводные = Новый Структура;
			Для Каждого ПараСвойства Из Данные Цикл
				Сводные.Вставить(ПараСвойства.Ключ, ПараСвойства.Значение);
			КонецЦикла;
			СводныеДанные.Вставить(Данные.Ключ, Сводные);
		Иначе
			Сводные.Количество = Сводные.Количество + Данные.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Массив;
	Для Каждого ПараДанных Из СводныеДанные Цикл
		Результат.Добавить(ПараДанных.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПеренумероватьМассив(МассивДанных)
	
	Номер = 0;
	Для Каждого Данные Из МассивДанных Цикл
		Номер = Номер + 1;
		Если Данные.Свойство("Номер") Тогда
			Данные.Номер = Номер;
		Иначе
			Данные.Вставить("Номер", Номер);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СообщитьПользователюСТекстомЛистаТребований(ТекстСообщения)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияСТекстомЛистаТребований(ТекстСообщения);
	Сообщение.Сообщить();
	
КонецПроцедуры

Функция ТекстСообщенияСТекстомЛистаТребований(ТекстСообщения)
	
	Возврат ТекстСообщения + " (Лист требований ЛТ6.9)";
	
КонецФункции

#КонецОбласти

// }}ПервыйБИТ Лист требований [ЛТ6.9] [Микляев К.А.] [09.06.2026] -
